-- phpMyAdmin SQL Dump
-- version 4.9.7
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Mar 25, 2021 at 12:50 PM
-- Server version: 5.7.32
-- PHP Version: 7.4.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `gs_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `file_table`
--

CREATE TABLE `file_table` (
  `id` int(11) NOT NULL,
  `file_name` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `file_path` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `name` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `zairyo` text COLLATE utf8_unicode_ci NOT NULL,
  `recipe` text COLLATE utf8_unicode_ci NOT NULL,
  `insert_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `upload_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `file_table`
--

INSERT INTO `file_table` (`id`, `file_name`, `file_path`, `name`, `zairyo`, `recipe`, `insert_time`, `upload_time`) VALUES
(19, '鯖パスタ.jpeg', 'img/20210325122455鯖パスタ.jpeg', 'サバ味噌缶の和風パスタ', 'パスタ300g(１人あたり100g)&#13;&#10;水3リットル&#13;&#10;塩30g&#13;&#10;■ (ソース)&#13;&#10;オリーブオイル大さじ2&#13;&#10;にんにくチューブ3cm&#13;&#10;鯖味噌缶1缶&#13;&#10;和風顆粒だし小さじ0.5〜1&#13;&#10;めんつゆ大さじ1〜2&#13;&#10;鰹節2～3パック&#13;&#10;大葉(無くてもOK)2～3枚&#13;&#10;', '1&#13;&#10;写真&#13;&#10;パスタを茹でる。茹で時間は指定時間より1分ほど短く。茹で汁をカップなどに50cc分けて取っておく。&#13;&#10;&#13;&#10;2&#13;&#10;写真&#13;&#10;玉ねぎをまず縦半分に切り、上下を切り落として縦に薄切りにする。&#13;&#10;&#13;&#10;3&#13;&#10;写真&#13;&#10;オリーブオイルとにんにくチューブをフライパンに入れて中火で加熱。フツフツしてきたら弱火にしてにんにくの香りを立たせる。&#13;&#10;&#13;&#10;4&#13;&#10;写真&#13;&#10;玉ねぎを入れて中火で透き通ってくるまで炒める。&#13;&#10;&#13;&#10;5&#13;&#10;写真&#13;&#10;サバ味噌缶を開けてフライパンへ。&#13;&#10;&#13;&#10;6&#13;&#10;写真&#13;&#10;サバをへらで少し崩す。崩しすぎない方が食べ応えがあります。1分程度混ぜて炒めます。&#13;&#10;&#13;&#10;7&#13;&#10;写真&#13;&#10;和風だし(顆粒)をふりかけて混ぜる。&#13;&#10;&#13;&#10;8&#13;&#10;写真&#13;&#10;茹で上がったパスタのお湯を切ってをフライパンへ。残した茹で汁30mlを入れる。全体的に混ぜてめんつゆを加える。&#13;&#10;&#13;&#10;9&#13;&#10;写真&#13;&#10;お皿に盛りつけ、鰹節と刻んだ大葉(無くてもOK )をのせてできあがり。', '2021-03-25 21:24:55', '2021-03-25 21:24:55'),
(20, 'deca16a049de9d77bf37a4d133bc8f95.jpeg', 'img/20210325122743deca16a049de9d77bf37a4d133bc8f95.jpeg', '茹で卵の肉巻き', '材料 （４個分）&#13;&#10;豚ロース薄切り８枚&#13;&#10;茹で卵４個&#13;&#10;塩胡椒適宜&#13;&#10;片栗粉適宜&#13;&#10;サラダ油適宜&#13;&#10;酒大さじ３&#13;&#10;醤油★大さじ１&#13;&#10;スイートチリソース★大さじ１&#13;&#10;はちみつ★大さじ１/２&#13;&#10;水★５０ｍｌ&#13;&#10;', '作り方&#13;&#10;1&#13;&#10;茹で卵に薄く片栗粉をまぶして、豚ロースを１個につき２枚を隙間なく巻きつける。全体に塩胡椒し、片栗粉を薄くまぶす。&#13;&#10;&#13;&#10;2&#13;&#10;フライパンにサラダ油を熱し、１を入れて強火で転がしながら焼く。全面に焼き目がついたら、余分な油はペーパーで拭きとる。&#13;&#10;&#13;&#10;3&#13;&#10;弱火にして酒をいれて蓋をし１分蒸し焼きに。その後★の材料を入れ絡めるように煮たらデキアガリ。&#13;&#10;&#13;&#10;4&#13;&#10;※たれをたっぷりかけて絡めて食べるとおいしいです。', '2021-03-25 21:27:43', '2021-03-25 21:27:43'),
(21, '8b7f6fabe90000fb5f94c21760a03974.jpeg', 'img/202103251230018b7f6fabe90000fb5f94c21760a03974.jpeg', 'スタミナ丼', 'ご飯200ｇ&#13;&#10;豚バラ肉(ブロック)約100ｇ&#13;&#10;もやし適量&#13;&#10;塩胡椒少々&#13;&#10;＊味噌大さじ2&#13;&#10;＊みりん大さじ2&#13;&#10;＊酒大さじ2&#13;&#10;＊砂糖大さじ1&#13;&#10;＊醤油大さじ1&#13;&#10;＊にんにく(チューブ)少々&#13;&#10;＊豆板醤お好みで&#13;&#10;ねぎ(小口切り)少々&#13;&#10;', '作り方&#13;&#10;1&#13;&#10;写真&#13;&#10;豚バラブロック肉は５mm位の厚さに切ります&#13;&#10;&#13;&#10;＊のタレは混ぜ合わせておく&#13;&#10;2&#13;&#10;写真&#13;&#10;ビニール袋に肉を入れ、＊のタレを半分だけ入れ、よくあえる（できれば30分～おく）&#13;&#10;&#13;&#10;その間にもやしを炒める（塩胡椒）&#13;&#10;&#13;&#10;3&#13;&#10;写真&#13;&#10;フライパンに油をひかず、②の肉を炒める（焦げやすいので弱火～中火で）&#13;&#10;&#13;&#10;火が通って照りが出たら、残しておいたタレも加える&#13;&#10;&#13;&#10;4&#13;&#10;写真&#13;&#10;丼にご飯を盛り、もやしとお肉をのせ、ねぎをパラパラっとして完成❤', '2021-03-25 21:30:01', '2021-03-25 21:30:01'),
(22, 'f15072ff0c0d289b84210c98e663d64f.jpeg', 'img/20210325123204f15072ff0c0d289b84210c98e663d64f.jpeg', 'きのこたっぷり回鍋肉', '■ 野菜&#13;&#10;┣ キャベツ1/4個&#13;&#10;┗ ピーマン2個&#13;&#10;■ きのこ類&#13;&#10;┣ しめじ1パック&#13;&#10;┣ まいたけ1パック&#13;&#10;┗ エリンギ1パック&#13;&#10;豚バラ薄切り肉(又はしゃぶしゃぶ肉)80g&#13;&#10;にんにく・生姜各1片&#13;&#10;鶏ガラスープの素小さじ1/2&#13;&#10;■ ◆回鍋肉の合わせ調味料&#13;&#10;┣ 甜麺醤(又は味噌)大さじ1&#13;&#10;┣ 砂糖・醤油各大さじ1弱&#13;&#10;┗ 豆板醤小さじ1/2〜1&#13;&#10;紹興酒(又は酒)大さじ1&#13;&#10;塩・胡椒適宜&#13;&#10;サラダ油大さじ2/3', '作り方&#13;&#10;1&#13;&#10;回鍋肉の合わせ調味料◆を混ぜておく。&#13;&#10;&#13;&#10;2&#13;&#10;野菜を切る。&#13;&#10;エリンギ→縦半分に切り5mm幅&#13;&#10;しめじ・舞茸→ほぐす&#13;&#10;キャベツ→一口大&#13;&#10;ピーマン→縦半分に切り1〜2cm幅&#13;&#10;&#13;&#10;3&#13;&#10;&#13;&#10;にんにく→みじん切り&#13;&#10;生姜→千切り&#13;&#10;&#13;&#10;にんにく、生姜はチューブでもOK&#13;&#10;&#13;&#10;4&#13;&#10;フライパンに油を熱し一口大に切った豚肉を色が変わる程度に炒め、皿に取り出しておく。&#13;&#10;&#13;&#10;5&#13;&#10;フライパンに油小さじ1(分量外)を足しニンニク・生姜を炒め香りが立ったら、野菜と鶏ガラスープの素を入れ炒める。&#13;&#10;&#13;&#10;6&#13;&#10;野菜に油がなじんだら、きのこ類を加え紹興酒を回し入れ蓋をする。&#13;&#10;きのこ類がしんなりしてきたら①と④を加え強火で炒める。', '2021-03-25 21:32:04', '2021-03-25 21:32:04'),
(23, 'a830b71e52049f2a5499c54b91d2e519.jpeg', 'img/20210325123405a830b71e52049f2a5499c54b91d2e519.jpeg', 'ふんわりグラタン', '材料 （2人分）&#13;&#10;豆腐1丁&#13;&#10;ツナ缶1缶&#13;&#10;とろけるチーズ2枚&#13;&#10;＊卵(L)2個&#13;&#10;＊牛乳1/2カップ&#13;&#10;＊塩小さじ1/3&#13;&#10;＊こしょう少々&#13;&#10;', '作り方&#13;&#10;1&#13;&#10;写真&#13;&#10;豆腐は水気を切り適当な大きさに切る。ツナ缶も汁気を切りほぐしておく。&#13;&#10;&#13;&#10;2&#13;&#10;写真&#13;&#10;耐熱皿に豆腐とツナを入れ、チーズをちぎってのせる。&#13;&#10;&#13;&#10;3&#13;&#10;写真&#13;&#10;＊を混ぜ合わせた卵ソースを静かに流しいれる。&#13;&#10;&#13;&#10;4&#13;&#10;写真&#13;&#10;オーブントースターで焦げ目がつくまで焼いて完成。', '2021-03-25 21:34:05', '2021-03-25 21:34:05'),
(24, '9e977e64bc3866eb8d65c5fcbea784a0.jpeg', 'img/202103251236059e977e64bc3866eb8d65c5fcbea784a0.jpeg', '鮭の香味パン粉焼き', '材料 （２人分）&#13;&#10;生鮭の切り身２切れ&#13;&#10;塩コショー少々&#13;&#10;小麦粉適量&#13;&#10;卵１個&#13;&#10;☆パン粉２/３カップ&#13;&#10;☆粉チーズ(パルメザン)小さじ１&#13;&#10;☆ガーリックパウダー小さじ１&#13;&#10;☆バジル(乾燥)少々&#13;&#10;オリーブオイル(サラダ油でもOK)大さじ４&#13;&#10;', '作り方&#13;&#10;1&#13;&#10;写真&#13;&#10;☆の材料をボウルに合わせ混ぜておきます。&#13;&#10;たまごは溶いておきます。&#13;&#10;&#13;&#10;2&#13;&#10;写真&#13;&#10;生鮭に骨があったら取り、４～５等分ぐらいにカットします。&#13;&#10;塩コショウをし、小麦粉を振ります。&#13;&#10;&#13;&#10;3&#13;&#10;写真&#13;&#10;たまごを付けたら、１)のパン粉を付けます。&#13;&#10;&#13;&#10;4&#13;&#10;写真&#13;&#10;フライパンにオリーブオイル２/３ほど入れて、中火で焼きます。&#13;&#10;裏返して残りのオリーブオイルを入れ焼き上げたら出来上がり。', '2021-03-25 21:36:05', '2021-03-25 21:36:05'),
(25, '2d2b4afa2e60bbe4d6078f72eb44464c.jpeg', 'img/202103251237202d2b4afa2e60bbe4d6078f72eb44464c.jpeg', '牛肉とシメジのしぐれ煮', '材料 （お弁当２～３人分）&#13;&#10;牛肉(切り落とし)１００ｇ&#13;&#10;しめじ1パック(約１００ｇ)&#13;&#10;生姜(あれば)少々&#13;&#10;★砂糖大さじ１&#13;&#10;★酒大さじ１&#13;&#10;★醤油大さじ１&#13;&#10;油(炒め用)少々&#13;&#10;いりごま(あれば)大さじ１&#13;&#10;一味唐辛子(お好みで)少々&#13;&#10;', '作り方&#13;&#10;1&#13;&#10;写真&#13;&#10;★の調味料は混ぜておく。&#13;&#10;生姜は千切りorおろしどちらでも。&#13;&#10;牛肉は食べやすい大きさに、しめじは石づきを切り落とします。&#13;&#10;&#13;&#10;2&#13;&#10;写真&#13;&#10;フライパンに油をひき生姜を炒め香りが出たら&#13;&#10;牛肉とシメジを入れ炒めます。&#13;&#10;&#13;&#10;3&#13;&#10;写真&#13;&#10;牛肉に火が通ったところで、★の調味料を入れ水分がなくなるまで炒める。&#13;&#10;&#13;&#10;4&#13;&#10;写真&#13;&#10;いりごま、一味唐辛子(お好みで)を振り入れさっと炒めて完成です。', '2021-03-25 21:37:20', '2021-03-25 21:37:20'),
(26, '0f4b06c52e979d3f3d2f5719a00b9420.jpeg', 'img/202103251238330f4b06c52e979d3f3d2f5719a00b9420.jpeg', '牛肉ハニーマスタード和え', '材料&#13;&#10;薄切り牛肉250gぐらい&#13;&#10;じゃがいも２個&#13;&#10;オリーブオイル適量&#13;&#10;塩胡椒適量&#13;&#10;■ ハニーマスタード(ID:3697004)&#13;&#10;★はちみつ小さじ４&#13;&#10;★粒マスタード大さじ１(小さじ３)&#13;&#10;★酒小さじ２&#13;&#10;★醤油小さじ１&#13;&#10;', '作り方&#13;&#10;1&#13;&#10;牛肉は食べやすい大きさに切る。&#13;&#10;&#13;&#10;2&#13;&#10;じゃがいもは皮をむいて芽を取り、７～８mmの厚さのいちょう切りにする。&#13;&#10;&#13;&#10;3&#13;&#10;耐熱容器にじゃがいもとひたひたの水を入れ、蓋(ラップ)をしてレンジで柔らかくなるまで加熱する。&#13;&#10;※目安:500Wで７分&#13;&#10;&#13;&#10;4&#13;&#10;その間に★の材料を混ぜてタレを作っておく。&#13;&#10;&#13;&#10;5&#13;&#10;フライパンにオリーブオイルを熱し、水気を切ったじゃがいもを炒める。&#13;&#10;&#13;&#10;6&#13;&#10;じゃがいもに油が回ったら牛肉を入れ、塩胡椒で下味をつける。&#13;&#10;&#13;&#10;7&#13;&#10;牛肉に火が通ったら余分な脂を拭き取り、４のタレを入れて絡めてできあがり♪&#13;&#10;&#13;&#10;', '2021-03-25 21:38:33', '2021-03-25 21:38:33'),
(27, '982ef5e156f75188c3828b8c2caa294f.jpeg', 'img/20210325123958982ef5e156f75188c3828b8c2caa294f.jpeg', '中華わかめスープ', '材料 （１人分）&#13;&#10;鶏がらスープの素（顆粒）小さじ１&#13;&#10;しょうゆ小さじ1/2&#13;&#10;白ねぎ（みじん切り）小さじ２&#13;&#10;乾燥わかめ大さじ1/2&#13;&#10;白ごまあれば少々&#13;&#10;塩少々&#13;&#10;こしょう少々&#13;&#10;熱湯２００cc&#13;&#10;', '作り方&#13;&#10;1&#13;&#10;写真&#13;&#10;カップにすべての材料を入れて、熱湯を注いで混ぜる。', '2021-03-25 21:39:58', '2021-03-25 21:39:58'),
(28, '37a83b4527148234c71e473095cae31e.jpeg', 'img/2021032512415537a83b4527148234c71e473095cae31e.jpeg', 'はまぐりチャウダー', '材料 （5人分）&#13;&#10;■ ≪酒蒸し用≫&#13;&#10;オリーブオイル大さじ1&#13;&#10;にんにく(みじん切り)1片&#13;&#10;はまぐり400g&#13;&#10;厚切りベーコン(短冊切り)80g&#13;&#10;菜の花(2等分)8本&#13;&#10;酒100ml&#13;&#10;■ ≪炒める用≫&#13;&#10;オリーブオイル大さじ2&#13;&#10;新玉ねぎ(さいの目切り)大1/2個&#13;&#10;新じゃがいも(さいの目切り)1個&#13;&#10;にんじん(さいの目切り)1/2本&#13;&#10;薄力粉大さじ2&#13;&#10;■ ≪煮込む用≫&#13;&#10;水2と1/2カップ&#13;&#10;牛乳1カップ&#13;&#10;生クリーム1カップ&#13;&#10;ローリエ1枚&#13;&#10;■ ≪味付け≫&#13;&#10;顆粒コンソメ小さじ2&#13;&#10;', '作り方&#13;&#10;1&#13;&#10;写真&#13;&#10;はまぐりを水に浸し、砂抜きをします。&#13;&#10;&#13;&#10;2&#13;&#10;フライパンに≪酒蒸し用≫のオリーブオイルを熱しベーコンをきつね色になるまで炒めにんにく、はまぐり加えます。&#13;&#10;&#13;&#10;3&#13;&#10;写真&#13;&#10;酒を加え蓋をし4分ほど蒸し焼きにしたら菜の花を加えよく混ぜたら火を止めておきます。&#13;&#10;4&#13;&#10;写真&#13;&#10;鍋に≪炒める用≫のオリーブオイルを熱し玉ねぎ、じゃがいも、にんじんをしんなりするまで炒めます。&#13;&#10;&#13;&#10;5&#13;&#10;写真&#13;&#10;火を止めて茶こしで薄力粉をまぶしながら全体をよく混ぜ合わせます。&#13;&#10;&#13;&#10;6&#13;&#10;写真&#13;&#10;再び火をつけ≪煮込む用≫の材料を順に加えます。&#13;&#10;&#13;&#10;7&#13;&#10;写真&#13;&#10;3を加え、煮立ったら≪味付け≫の材料を加え出来上がりです。', '2021-03-25 21:41:55', '2021-03-25 21:41:55'),
(29, 'b3c14e1151e9be8f1c9bf7a9b0fc2233.jpeg', 'img/20210325124356b3c14e1151e9be8f1c9bf7a9b0fc2233.jpeg', 'ふわふわパンケーキ', '材料 （１人分(3枚)）&#13;&#10;卵Ｌ１個&#13;&#10;グラニュー糖10ｇ&#13;&#10;薄力粉か強力粉15ｇ&#13;&#10;ベーキングパウダー１ｇ&#13;&#10;牛乳10ｇ&#13;&#10;', '作り方&#13;&#10;1&#13;&#10;材料を準備し、ホットプレートを保温程度の弱で温めスタート。&#13;&#10;お湯を沸かしておく。&#13;&#10;&#13;&#10;※工程写真は２人分作ってます。&#13;&#10;&#13;&#10;2&#13;&#10;写真&#13;&#10;①卵を卵黄と卵白に分け卵白は冷凍庫へ。&#13;&#10;&#13;&#10;卵黄に牛乳、振るった薄力粉(強力粉)とベーキングパウダーを合わせてよく混ぜる。&#13;&#10;&#13;&#10;3&#13;&#10;写真&#13;&#10;②冷えた卵白にグラニュー糖を3回に分けて加え固めのメレンゲを作る。&#13;&#10;&#13;&#10;&#13;&#10;4&#13;&#10;③出来たメレンゲの出来の悪そうな所をひとすくいとり、①の生地にしっかり混ぜる。&#13;&#10;&#13;&#10;5&#13;&#10;写真&#13;&#10;④、③で混ぜた生地を残りのメレンゲに合わせます。&#13;&#10;&#13;&#10;6&#13;&#10;写真&#13;&#10;⑤、下からすくって返してを繰り返しながら、少々メレンゲが残る程度まで混ぜます。&#13;&#10;&#13;&#10;7&#13;&#10;写真&#13;&#10;⑥ホットプレートに薄く油を敷き、生地をこんもりのせる。&#13;&#10;&#13;&#10;熱湯大1/2～１を加えて蒸気焼き開始(弱火でじっくり焼きます)&#13;&#10;&#13;&#10;8&#13;&#10;写真&#13;&#10;⑦、蓋をして焼いていきます。&#13;&#10;時々ホットプレートの中の水分を蒸発させるように傾けて焼くと〇。&#13;&#10;9&#13;&#10;写真&#13;&#10;⑧底に焼き色がついたら優しく返し、再度熱湯を加え蓋をして蒸気焼きします。&#13;&#10;&#13;&#10;側面をヘラで触って生地がつかなくなったら完成', '2021-03-25 21:43:56', '2021-03-25 21:43:56'),
(30, 'feab290eb7d1f2dcf502d97002695875.jpeg', 'img/20210325124451feab290eb7d1f2dcf502d97002695875.jpeg', 'シナモンシュガーワッフル', '材料 （7〜８個分）&#13;&#10;玉子1個&#13;&#10;シナモンシュガー5g&#13;&#10;牛乳120g&#13;&#10;HM（ホットケーキミックス）200g&#13;&#10;溶かしバター30g&#13;&#10;溶かしバター（天板に塗る用）適量&#13;&#10;', '作り方&#13;&#10;1&#13;&#10;ワッフルメーカー（ビタントニオ使用）に電源を入れ、温める&#13;&#10;&#13;&#10;2&#13;&#10;材料を記載通りの順にボウルに入れて、牛乳まではその都度よく混ぜ合わせ、HM・溶かしバターはさっくり混ぜ合わせる&#13;&#10;&#13;&#10;3&#13;&#10;刷毛を使って、天板に溶かしバターを塗り、2をお玉1杯分ずつ流し入れて焼く&#13;&#10;&#13;&#10;4&#13;&#10;写真&#13;&#10;きつね色にこんがり焼けたら、出来上がり！', '2021-03-25 21:44:51', '2021-03-25 21:44:51');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `file_table`
--
ALTER TABLE `file_table`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `file_path` (`file_path`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `file_table`
--
ALTER TABLE `file_table`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
